  /* --------------------------- REXX -------------------------------- */
   return 'YES'
  /* RACFDCON determines if group connections should be displayed      |
   | in the Group Profile list display                                 |
   * ----------------------------------------------------------------- */
