  /* --------------------------- REXX -------------------------------- */
   return '/'
  /* RACFDSEP defines the date separator used by User/Group Profiles   |
   | '/'  slash                                                        |
   | '-'  dash                                                         |
   | '.'  dot                                                          |
   | ' '  space                                                        |
   | ''   null                                                         |
   * ----------------------------------------------------------------- */
