)CM*------------------------------------------------------------------*
)CM*  Purpose:  RACFADM - General Resources - SAve command
)CM*------------------------------------------------------------------*
)CM*  FLG  YYMMDD  USERID   DESCRIPTION
)CM*  ---  ------  -------  ------------------------------------------
)CM*  @A2  240918  TRIDJK   Added Description field
)CM*  @A1  200616  RACFA    Added capability to SAve file as TXT/CSV
)CM*  @A0  200611  RACFA    Created skeleton
)CM*------------------------------------------------------------------*
)SEL &RACFSFIL = T
 &ZDATESTD ----------( RACFADM - General Resources )----------- &ZTIME
)BLANK
 Class           Description
 ---------------------------------------------------------------------
)TB 2 18
)DOT &TABLEA
)SETF CLASS   = &LEFT(&CLASS,8, )
)SETF CDESC   = &LEFT(&CDESC,57, )
!&CLASS!&CDESC
)ENDDOT
)ENDSEL
)SEL &RACFSFIL = C
RACFADM - General Resources
Class           Description
-------------------------------------------------------------------------
)DOT &TABLEA
)SETF CLASS   = &STRIP(&CLASS,, )
)SETF CDESC   = &STRIP(&CDESC,, )
&CLASS,&CDESC
)ENDDOT
)ENDSEL
